package core_ls_5;

public class Main {
    public static void main(String[] args) {
        /*
         * Написать функцию, создающую резервную копию всех файлов в директории
         * (без поддиректорий) во вновь созданную папку ./backup
         */

        Archivist backup1 = new Archivist();
        backup1.saveFile();

        /*
         * Предположить, что числа в исходном массиве из 9 элементов имеют диапазон[0,
         * 3],
         * и представляют собой, например, состояния ячеек поля для игры в
         * крестикинолики,
         * где 0 – это пустое поле, 1 – это поле с крестиком, 2 – это поле с ноликом,
         * 3 – резервное значение. Такое предположение позволит хранить в одном числе
         * типа int
         * всё поле 3х3. Записать в файл 9 значений так, чтобы они заняли три байта.
         */

        Board board = new Board();
        int[] array = { 0, 0, 0, 0, 0, 0, 1, 2, 3 };
        board.writeBoard(array);
        board.readBoard();

    }
}
